Информационная_база/src/InformationRegisters/СоответствиеНоменклатурыЕГАИС/СоответствиеНоменклатурыЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствиеНоменклатурыЕГАИС</name>
  <resources>
    <name>УдалитьАлкогольнаяПродукция</name>
    <type>
      <types>CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</types>
    </type>
  </resources>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусУказанияСерий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>DefinedType.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.ХарактеристикаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АлкогольнаяПродукция</name>
    <type>
      <types>CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>DefinedType.СерияНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Справка2</name>
    <type>
      <types>CatalogRef.Справки2ЕГАИС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Информационная_база/src/Catalogs/КлассификаторАлкогольнойПродукцииЕГАИС/КлассификаторАлкогольнойПродукцииЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассификаторАлкогольнойПродукцииЕГАИС</name>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНоменклатура</name>
    <type>
      <types>DefinedType.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХарактеристика</name>
    <type>
      <types>DefinedType.ХарактеристикаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСопоставлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПродукции</name>
    <type>
      <types>EnumRef.ТипыПродукцииЕГАИС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьУпаковки</name>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.Упаковка</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Информационная_база/src/CommonModules/КорректировкаОстатковЕГАИСПереопределяемый/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает запрос на получение учетных остатков.
//
// Параметры:
//  ДатаОстатков - Дата - дата получения остатков,
//  Организация - ОпределяемыйТип.ОрганизацияКонтрагентЕГАИС - ссылка на собственную организацию,
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - торговый объект для получения остатков,
//  КорректироватьОстаткиНемаркируемойПродукции - Булево - признак корректировки остатков немаркируемой продукции.
//
// Возвращаемое значение:
//   Запрос - запрос учетных остатков.
//
Функция ЗапросУчетныхОстатков(ДатаОстатков, Организация, ТорговыйОбъект, КорректироватьОстаткиНемаркируемойПродукции) Экспорт
	
	
	Возврат Неопределено;
	
КонецФункции

// Заполняет в табличной части коэффициент пересчета в декалитры для базовой единицы измерения номенклатуры.
//
// Параметры:
//  ТабличнаяЧасть - ТабличнаяЧасть - табличная часть, в которой нужно обновить коэффициент.
//
Процедура ЗаполнитьКоэффициентПересчетаВДАЛ(ТабличнаяЧасть) Экспорт
	
	
	Возврат;
	
КонецПроцедуры

// В процедуре нужно заполнить пустые значения из таблицы соответствий.
//
// Параметры:
//  ТаблицаСопоставления - ТаблицаЗначений - таблица для заполнения с колонками:
//      * Номенклатура          - ОпределяемыйТип.Номенклатура - ссылка на номенклатуру,
//      * Характеристика        - ОпределяемыйТип.ХарактеристикаНоменклатуры - ссылка на характеристику,
//      * Упаковка              - ОпределяемыйТип.Упаковка - ссылка на упаковку,
//      * АлкогольнаяПродукция  - СправочникСсылка.КлассификаторАлкогольнойПродукцииЕГАИС - ссылка на алкогольную продукцию,
//      * ИдентификаторУпаковки - Строка - наименование упаковки поставщика.
//
Процедура ЗаполнитьНесопоставленнуюПродукцию(ТаблицаСопоставления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаСопоставления", ТаблицаСопоставления);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаСопоставления.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ТаблицаСопоставления.АлкогольнаяПродукция КАК Справочник.КлассификаторАлкогольнойПродукцииЕГАИС) КАК АлкогольнаяПродукция,
	|	ТаблицаСопоставления.Характеристика КАК Характеристика,
	|	ТаблицаСопоставления.Упаковка КАК Упаковка,
	|	ТаблицаСопоставления.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
	|	ТаблицаСопоставления.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТСопоставления
	|ИЗ
	|	&ТаблицаСопоставления КАК ТаблицаСопоставления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТСопоставления.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|		ИНАЧЕ ВТСопоставления.Номенклатура
	|	КОНЕЦ КАК Номенклатура,
	|	ВТСопоставления.Характеристика КАК Характеристика,
	|	ВТСопоставления.Упаковка КАК Упаковка,
	|	ВТСопоставления.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	ВТСопоставления.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
	|	ВТСопоставления.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВТСопоставления КАК ВТСопоставления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	|		ПО ВТСопоставления.АлкогольнаяПродукция = СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция
	|			И ВТСопоставления.ИдентификаторУпаковки = СоответствиеНоменклатурыЕГАИС.ИдентификаторУпаковки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ТаблицаСопоставления = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

// В процедуре необходимо определить значения переменных ЭтоСклад и ЭтоТорговыйЗал в зависимости от типа торгового объекта.
//
// Параметры:
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - ссылка на собственный торговый объект,
//  ЭтоСклад - Булево - признак того, что торговый объект является складским помещением. Выходной параметр,
//  ЭтоТорговыйЗал - Булево - признак того, что торговый объект является торговым залом. Выходной параметр.
//
Процедура ПриОпределенииТипаТорговогоОбъекта(ТорговыйОбъект, ЭтоСклад, ЭтоТорговыйЗал) Экспорт
	
	
	Возврат;
	
КонецПроцедуры

// Проверяет наличие документа инвентаризации по складу.
//
// Параметры:
//  Организация - ОпределяемыйТип.ОрганизацияКонтрагентЕГАИС - ссылка на собственную организацию,
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - ссылка на собственный торговый объект,
//  ТекстОшибкиСклад - Строка, ФорматированнаяСтрока - текст ошибки проверки инвентаризации на складе. Выходной параметр,
//  ТекстОшибкиТорговыйЗал - Строка, ФорматированнаяСтрока - текст ошибки проверки инвентаризации в торговом зале. Выходной параметр,
//  ОтчетПоРасхождениямСклад - Булево - если Истина, будет доступна ссылка на формирование отчета по излишкам/недостачам. Выходной параметр,
//  ОтчетПоРасхождениямТорговыйЗал - Булево - если Истина, будет доступна ссылка на формирование отчета по излишкам/недостачам. Выходной параметр.
//
Процедура ПроверитьНаличиеИнвентаризации(Организация, ТорговыйОбъект, ТекстОшибкиСклад, ТекстОшибкиТорговыйЗал, ОтчетПоРасхождениямСклад, ОтчетПоРасхождениямТорговыйЗал) Экспорт
	
	
	Возврат;
	
КонецПроцедуры

// Вызывается после заполнения таблицы значений неподтвержденными документами.
//
// Параметры:
//  НеподтвержденныеДокументы - ТаблицаЗначений - таблица с найденными неподтвержденными документами,
//  ОрганизацияЕГАИС - СправочникСсылка.КлассификаторОрганизацийЕГАИС - собственная организация по классификатору.
//
Процедура ПриПроверкеНеподтвержденныхДокументов(НеподтвержденныеДокументы, ОрганизацияЕГАИС) Экспорт
	
	
	Возврат;
	
КонецПроцедуры

// Вызывается после заполнения таблицы значений документами, требующих оформления.
//
// Параметры:
//  НеоформленныеДокументы - ТаблицаЗначений - таблица с найденными документами,
//  ОрганизацияЕГАИС - СправочникСсылка.КлассификаторОрганизацийЕГАИС - собственная организация по классификатору.
//
Процедура ПриПроверкеНеоформленныхДокументов(НеоформленныеДокументы, ОрганизацияЕГАИС) Экспорт
	
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти
